Revit 2027 API
RebarShapeConstraintSagittaLength Constructor
 Create a constraint to drive sagitta length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraintSagittaLength(
	ElementId paramId
)
Public Sub New (
	paramId As ElementId
)
public:
RebarShapeConstraintSagittaLength(
	ElementId^ paramId
)
new :
        paramId : ElementId -> RebarShapeConstraintSagittaLength
Parameters
paramId ElementId
 The Id of a Rebar Shape parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeConstraintSagittaLength Class
Autodesk.Revit.DB.Structure Namespace